aaron-bond.better-comments
ecmel.vscode-html-css
emeraldwalk.RunOnSave
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
foxundermoon.shell-format
GitHub.copilot
James-Yu.latex-workshop
jeanp413.open-remote-ssh
KevinRose.vsc-python-indent
lukapetrovic.image-resizer
ms-azuretools.vscode-docker
ms-python.python
ms-vscode.cpptools
PKief.material-icon-theme
redhat.vscode-xml
timonwong.shellcheck
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
